#include "kaiguan.h"

KaiGuan::KaiGuan()
{
    //静态变量不能在构造函数里面初始化,所以在外面初始化
    //初始化的时候要写数据类型
}
//初始化数据
int KaiGuan::cf=0;
int KaiGuan::dd=0;
int KaiGuan::start1=0;
int KaiGuan::station_start;
int KaiGuan::station_location;
int KaiGuan::station_rear;

int KaiGuan::station_starte;
int KaiGuan::station_locatione;
int KaiGuan::station_reare;

int KaiGuan::start2=0;
int KaiGuan::end1=0;
int KaiGuan::end2=0;
QString KaiGuan::name[5][100]={/*10号线*/{"苏州街","知春里","知春路","西土城","牡丹园","健德门","北土城","安贞门","惠新西街南口","芍药居","太阳宫","三元桥","亮马桥","农业展览馆","团结湖","呼家楼","金台夕照","国贸","双井","劲松","潘家园","十里河","分钟寺","成寿寺","宋家庄","石榴庄","大红门","角门东","角门西","草桥","丰台站","泥洼","西局","六里桥","莲花桥","公主坟","西钓鱼台","慈寿寺","车道沟","长春桥","火器营","巴沟"},
                               /*13号线*/{"大钟寺","知春路","五道口","上地","西二旗","龙泽","回龙观","霍营","立水桥","北苑","望京西","芍药居","光熙门","柳芳"},
                               /*2号线*/{"西直门","积水潭","鼓楼大街","安定门","雍和宫","东直门","东四十条","朝阳门","建国门","北京站","崇文门","前门","和平门","宣武门","长椿街","复兴门","车公庄"},
                               /*15号线*/{"清华东路西口","六道口","北沙滩","奥林匹克公园","安立路","大屯东路","关庄","望京西","望京","望京东","崔各庄"},
                               /*5号线*/{"天通苑","天通苑南","立水桥","立水桥南","北苑路北","大屯路东","惠新西街南口","和平西桥","和平里北街","雍和宫","北新桥","东四","灯市口","东单","崇文门","磁器口","天坛东门","蒲黄榆","宋家庄"}};
